---
kind: method
id: M:Autodesk.Revit.DB.SelectionFilterElement.Clear
source: html/7f483abc-ae0f-3c0c-a3fc-b78ae1fcf54b.htm
---
# Autodesk.Revit.DB.SelectionFilterElement.Clear Method

Removes all ElementIds from the filter.

## Syntax (C#)
```csharp
public void Clear()
```